app/Controllers/Auth.php

    public function processLogin()
{
    $session = session();

    $model = new \App\Models\UserModel();

    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'ferry'
 LIMIT 1