app/Controllers/Auth.php

    public function processLogin()
    {
        $session = session();

        $model = new UserModel();

        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Cari user berdasarkan email
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'ferry@gmail.com'
 LIMIT 1