app/Controllers/Booking.php

    public function index()
    {
        $builder = $this->booking
            ->select('booking.*, users.nama, mobil.nama_mobil')
            ->join('users', 'users.id = booking.user_id')
            ->join('mobil', 'mobil.id = booking.mobil_id');

        // Customer hanya melihat booking miliknya
        if (session()->get('role') == 'customer') {
            $builder->where('booking.user_id', session()->get('id'));
        }

        $data = [
            'title'   => 'Data Booking',
            'booking' => $builder->findAll()
---
SELECT `booking`.*, `users`.`nama`, `mobil`.`nama_mobil`
FROM `booking`
JOIN `users` ON `users`.`id` = `booking`.`user_id`
JOIN `mobil` ON `mobil`.`id` = `booking`.`mobil_id`