app/Controllers/Customer.php

    public function index()
    {
        $data = [
            'title' => 'Home',
            'mobil' => $this->mobil
                ->where('status', 'Tersedia')
                ->findAll()
        ];
---
SELECT *
FROM `mobil`
WHERE `status` = 'Tersedia'

    public function bookingSaya()
    {
        if (!session()->get('logged_in')) {

            return redirect()->to('/login');

        }

        $bookingModel = new BookingModel();

        $booking = $bookingModel
            ->select('booking.*, mobil.nama_mobil, mobil.gambar')
            ->join('mobil', 'mobil.id = booking.mobil_id')
            ->where('booking.user_id', session()->get('id'))
            ->orderBy('booking.id', 'DESC')
            ->findAll();
---
SELECT `booking`.*, `mobil`.`nama_mobil`, `mobil`.`gambar`
FROM `booking`
JOIN `mobil` ON `mobil`.`id` = `booking`.`mobil_id`
WHERE `booking`.`user_id` = '2'
ORDER BY `booking`.`id` DESC

    public function profil()
    {
        $userModel = new \App\Models\UserModel();

        $user = $userModel->find(session()->get('id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'

    public function editProfil()
{
    $userModel = new \App\Models\UserModel();

    $user = $userModel->find(session()->get('id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'

    public function updatePassword()
    {
        $userModel = new \App\Models\UserModel();

        $id = session()->get('id');

        $user = $userModel->find($id);

        $passwordLama = $this->request->getPost('password_lama');
        $passwordBaru = $this->request->getPost('password_baru');
        $konfirmasi = $this->request->getPost('konfirmasi_password');

        if (!password_verify($passwordLama, $user['password'])) {

            return redirect()->back()->with('error', 'Password lama tidak sesuai.');

        }

        if ($passwordBaru != $konfirmasi) {

            return redirect()->back()->with('error', 'Konfirmasi password tidak cocok.');

        }

        $userModel->update($id, [

            'password' => password_hash($passwordBaru, PASSWORD_DEFAULT)

        ]);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
UPDATE `users` SET `password` = '$2y$10$hn0aFWZ7ne.sTFwisu2M8u7GPFuRg8DXVePDgKKJYORR8WaavNxi.', `updated_at` = '2026-07-05 08:12:21'
WHERE `users`.`id` IN ('2')