app/Controllers/Dashboard.php

    public function index()
    {
        $mobilModel   = new MobilModel();
        $bookingModel = new BookingModel();
        $userModel    = new UserModel();

        // Total Mobil
        $totalMobil = $mobilModel->countAllResults();

        // Total Booking
        $totalBooking = $bookingModel->countAllResults();

        // Total Customer
        $totalCustomer = $userModel
                            ->where('role', 'customer')
                            ->countAllResults();

        // Total Pendapatan (booking selesai)
        $pendapatan = $bookingModel
                        ->selectSum('total_harga')
                        ->where('status', 'Selesai')
                        ->first();

        // Booking Terbaru
        $bookingTerbaru = $bookingModel
            ->select('booking.*, users.nama, mobil.nama_mobil')
            ->join('users', 'users.id = booking.user_id')
            ->join('mobil', 'mobil.id = booking.mobil_id')
            ->orderBy('booking.id', 'DESC')
            ->limit(5)
            ->find();
---
SELECT COUNT(*) AS `numrows`
FROM `mobil`
SELECT COUNT(*) AS `numrows`
FROM `booking`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'customer'
SELECT SUM(`total_harga`) AS `total_harga`
FROM `booking`
WHERE `status` = 'Selesai'
 LIMIT 1
SELECT `booking`.*, `users`.`nama`, `mobil`.`nama_mobil`
FROM `booking`
JOIN `users` ON `users`.`id` = `booking`.`user_id`
JOIN `mobil` ON `mobil`.`id` = `booking`.`mobil_id`
ORDER BY `booking`.`id` DESC
 LIMIT 5