app/Controllers/Mobil.php

    public function index()
    {
        $data = [
            'title' => 'Data Mobil',
            'mobil' => $this->mobil->findAll()
---
SELECT *
FROM `mobil`