app/Controllers/User.php

    public function index()
    {
        $data = [

            'title' => 'Data User',

            'users' => $this->user->findAll()
---
SELECT *
FROM `users`